src/InformationRegisters/onyx_НастройкиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>onyx_НастройкиAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>APIКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутСоединения</Name>
					<Comment>Таймаут соединения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутЧтения</Name>
					<Comment>Таймаут чтения (секунды)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеВремяПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_КонтурAPI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/onyx_ПодключениеКAPI/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Возвращает структуру с настройками интеграции.
// Возвращаемое значение:
//   Структура - настройки из регистра сведений "onyx_НастройкиAPI".
Функция ПолучитьНастройкиAPI() Экспорт
	
	Возврат РегистрыСведений.onyx_НастройкиAPI.ПолучитьНастройки();
	
КонецФункции

// Возвращает токен авторизации для подключения к API Onyx.
// В текущей версии API Onyx токен равен API ключу.
// Параметры:
//   Обновить - Булево - не используется, оставлен для совместимости.
// Возвращаемое значение:
//   Строка - токен авторизации (API ключ).
Функция ПолучитьТокенАвторизации(Обновить = Ложь) Экспорт
	
	Настройки = РегистрыСведений.onyx_НастройкиAPI.ПолучитьНастройки();
	Если ПустаяСтрока(Настройки.APIКлюч) Тогда
		ВызватьИсключение НСтр("ru='Не указан API ключ для подключения к Onyx.'");
	КонецЕсли;
	
	// В текущей версии API Onyx токен = API ключ
	Возврат Настройки.APIКлюч;
	
КонецФункции

// Формирует набор HTTP-заголовков для обращения к API Onyx.
// Параметры:
//   ДополнительныеЗаголовки - Соответствие - дополнительные заголовки запроса (необязательный).
// Возвращаемое значение:
//   Соответствие - итоговые заголовки HTTP.
Функция СформироватьЗаголовки(ДополнительныеЗаголовки = Неопределено) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Accept", "application/json");
	
	Попытка
		Токен = ПолучитьТокенАвторизации();
		Если Не ПустаяСтрока(Токен) Тогда
			Заголовки.Вставить("Authorization", "Bearer " + Токен);
		КонецЕсли;
	Исключение
		СообщениеОбОшибке = НСтр("ru='Не удалось получить токен авторизации для формирования заголовков: %1'");
		ТекстОшибки = ОписаниеОшибки();
		ЗаписатьЖурналРегистрации(
		УровеньЖурналаРегистрации.Предупреждение,
		"onyx_ПодключениеКAPI",
		СтрШаблон(СообщениеОбОшибке, ТекстОшибки),
		"onyx");
	КонецПопытки;
	
	Если ТипЗнч(ДополнительныеЗаголовки) = Тип("Соответствие") Тогда
		Для Каждого ЭлементЗаголовка Из ДополнительныеЗаголовки Цикл
			Заголовки.Вставить(ЭлементЗаголовка.Ключ, ЭлементЗаголовка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Заголовки;
	
КонецФункции

// Выполняет HTTP-запрос к API Onyx.
// Параметры:
//   Метод - Строка - HTTP-метод (GET, POST и т.д.).
//   Путь - Строка - относительный путь без ведущего слеша.
//   ПараметрыЗапроса - Структура - дополнительные параметры (Данные, Параметры, Заголовки, ТипЗапроса, ТипОперации).
// Возвращаемое значение:
//   Структура - результат запроса, проверенный модулем onyx_ОбработкаОшибок.
Функция ВыполнитьЗапрос(Метод, Путь, ПараметрыЗапроса = Неопределено) Экспорт
	
	Настройки = РегистрыСведений.onyx_НастройкиAPI.ПолучитьНастройки();
	Если ПустаяСтрока(Настройки.БазовыйURL) Тогда
		ВызватьИсключение НСтр("ru='Не указан базовый URL для API Onyx.'");
	КонецЕсли;
	
	Параметры = НормализоватьПараметрыЗапроса(ПараметрыЗапроса);
	
	ИтоговыеЗаголовки = СформироватьЗаголовки(Параметры.Заголовки);
	
	БазовыйURL = НормализоватьБазовыйURL(Настройки.БазовыйURL);
	ПолныйАдрес = СформироватьПолныйАдрес(БазовыйURL, Путь);
	
	Сессия = onyx_КоннекторHTTP.СоздатьСессию();
	Сессия.Заголовки = ИтоговыеЗаголовки;
	
	ДопПараметры = onyx_КоннекторHTTP.НовыеПараметры();
	ДопПараметры.Заголовки = ИтоговыеЗаголовки;
	ДопПараметры.ПараметрыЗапроса = Параметры.Параметры;
	ДопПараметры.Таймаут = ЗначениеИлиПоУмолчанию(
	Настройки.ТаймаутСоединения,
	ТаймаутСоединенияПоУмолчанию());
	ДопПараметры.МаксимальноеКоличествоПовторов =
	ЗначениеИлиПоУмолчанию(
	Настройки.МаксимальноеКоличествоПовторов,
	МаксимальноеКоличествоПовторовПоУмолчанию());
	МаксмВремяПовторов = ЗначениеИлиПоУмолчанию(
	Настройки.МаксимальноеВремяПовторов,
	МаксимальноеВремяПовторовПоУмолчаниюВМинутах());
	ДопПараметры.МаксимальноеВремяПовторов =
	МаксмВремяПовторов * КоличествоСекундВМинуте();
	ПреобразованиеJSON = Новый Структура;
	ПреобразованиеJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ДопПараметры.ПараметрыПреобразованияJSON = ПреобразованиеJSON;
	
	Попытка
		Токен = ПолучитьТокенАвторизации();
		Если ЗначениеЗаполнено(Токен) Тогда
			ДопПараметры.Аутентификация = onyx_КоннекторHTTP.НоваяАутентификацияBearer(Токен);
		КонецЕсли;
	Исключение
		// Игнорируем ошибки получения токена - заголовки остаются пустыми.
		// Это может быть нормальной ситуацией, если токен не настроен.
		// Ошибка логируется в журнале регистрации для диагностики.
		Попытка
			ЗаписьЖурналаРегистрации(
				"onyx_ПодключениеКAPI.ОшибкаПолученияТокена",
				УровеньЖурналаРегистрации.Предупреждение,
				, , ,
				ОписаниеОшибки()
			);
		Исключение
			// Игнорируем ошибки логирования - это не критично
			// Ошибка намеренно игнорируется, так как логирование не является критичной операцией
			ИгнорируемОшибку = Истина;
		КонецПопытки;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Параметры.Данные) Тогда
		Если ТипЗнч(Параметры.Данные) = Тип("Строка") Тогда
			ДопПараметры.Данные = Параметры.Данные;
		Иначе
			ДопПараметры.Json = Параметры.Данные;
		КонецЕсли;
	КонецЕсли;
	
	ОтветКоннектора = onyx_КоннекторHTTP.ВызватьМетод(Метод, ПолныйАдрес, ДопПараметры, Сессия);
	Результат = ПреобразоватьОтветКоннектора(ОтветКоннектора);
	
	Возврат onyx_ОбработкаОшибок.ПроверитьОтвет(
	Результат,
	Настройки,
	Параметры.ТипЗапроса,
	Параметры.ТипОперации);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции модуля

// Нормализует структуру дополнительных параметров запроса.
// Параметры:
//   ПараметрыЗапроса - Произвольный - структура или соответствие с дополнительными параметрами.
// Возвращаемое значение:
//   Структура - нормализованные значения (Данные, Параметры, Заголовки, ТипЗапроса, ТипОперации).
Функция НормализоватьПараметрыЗапроса(ПараметрыЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Неопределено);
	Результат.Вставить("Параметры", Неопределено);
	Результат.Вставить("Заголовки", Неопределено);
	Результат.Вставить("ТипЗапроса", Неопределено);
	Результат.Вставить("ТипОперации", Неопределено);
	
	ТипПараметров = ТипЗнч(ПараметрыЗапроса);
	
	Если ТипПараметров = Тип("Структура") Тогда
		ЗаполнитьПараметрыИзСтруктуры(Результат, ПараметрыЗапроса);
		ОчиститьНесоответствующиеТипы(Результат);
		Возврат Результат;
	КонецЕсли;
	
	Если ТипПараметров = Тип("Соответствие") Тогда
		ЗаполнитьПараметрыИзСоответствия(Результат, ПараметрыЗапроса);
	КонецЕсли;
	
	ОчиститьНесоответствующиеТипы(Результат);
	Возврат Результат;
	
КонецФункции

// Заполняет структуру параметров значениями из структуры-источника.
// Параметры:
//   Результат - Структура - структура назначения.
//   Источник - Структура - структура-источник.
Процедура ЗаполнитьПараметрыИзСтруктуры(Результат, Источник)
	
	УстановитьЗначениеИзСтруктуры(Результат, Источник, "Данные");
	УстановитьЗначениеИзСтруктуры(Результат, Источник, "Параметры");
	УстановитьЗначениеИзСтруктуры(Результат, Источник, "Заголовки");
	УстановитьЗначениеИзСтруктуры(Результат, Источник, "ТипЗапроса");
	УстановитьЗначениеИзСтруктуры(Результат, Источник, "ТипОперации");
	
КонецПроцедуры

// Заполняет структуру параметров значениями из соответствия.
// Параметры:
//   Результат - Структура - структура назначения.
//   Источник - Соответствие - соответствие-источник.
Процедура ЗаполнитьПараметрыИзСоответствия(Результат, Источник)
	
	УстановитьЗначениеИзСоответствия(Результат, Источник, "Данные");
	УстановитьЗначениеИзСоответствия(Результат, Источник, "Параметры");
	УстановитьЗначениеИзСоответствия(Результат, Источник, "Заголовки");
	УстановитьЗначениеИзСоответствия(Результат, Источник, "ТипЗапроса");
	УстановитьЗначениеИзСоответствия(Результат, Источник, "ТипОперации");
	
КонецПроцедуры

// Устанавливает значение в структуру, если оно присутствует в структуре-источнике.
//
// Параметры:
//   СтруктураНазначения - Структура - объект для заполнения.
//   СтруктураИсточника - Структура - источник данных.
//   ИмяПоля - Строка - имя поля для копирования.
Процедура УстановитьЗначениеИзСтруктуры(СтруктураНазначения, СтруктураИсточника, ИмяПоля)
	
	Если СтруктураИсточника.Свойство(ИмяПоля) Тогда
		СтруктураНазначения[ИмяПоля] = СтруктураИсточника[ИмяПоля];
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает значение в структуру, если оно присутствует в соответствии-источнике.
//
// Параметры:
//   СтруктураНазначения - Структура - объект для заполнения.
//   СоответствиеИсточника - Соответствие - источник данных.
//   ИмяПоля - Строка - ключ соответствия.
Процедура УстановитьЗначениеИзСоответствия(СтруктураНазначения, СоответствиеИсточника, ИмяПоля)
	
	Если СоответствиеИсточника.СодержитКлюч(ИмяПоля) Тогда
		СтруктураНазначения[ИмяПоля] = СоответствиеИсточника.Получить(ИмяПоля);
	КонецЕсли;
	
КонецПроцедуры

// Очищает поля структуры параметров, если их значения имеют неподходящий тип.
//
// Параметры:
//   Параметры - Структура - нормализованные значения параметров запроса.
Процедура ОчиститьНесоответствующиеТипы(Параметры)
	
	Если Параметры.Параметры <> Неопределено
		И ТипЗнч(Параметры.Параметры) <> Тип("Соответствие") Тогда
		Параметры.Параметры = Неопределено;
	КонецЕсли;
	
	Если Параметры.Заголовки <> Неопределено
		И ТипЗнч(Параметры.Заголовки) <> Тип("Соответствие") Тогда
		Параметры.Заголовки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значение, если оно заполнено, иначе значение по умолчанию.
// Параметры:
//   Значение - Произвольный - проверяемое значение.
//   ЗначениеПоУмолчанию - Произвольный - значение по умолчанию.
// Возвращаемое значение:
//   Произвольный - исходное значение или значение по умолчанию.
Функция ЗначениеИлиПоУмолчанию(Значение, ЗначениеПоУмолчанию)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции


Функция КоличествоСекундВМинуте()
	
	Возврат 60;
	
КонецФункции

Функция ТаймаутСоединенияПоУмолчанию()
	
	Возврат 30;
	
КонецФункции

Функция МаксимальноеКоличествоПовторовПоУмолчанию()
	
	Возврат 5;
	
КонецФункции

Функция МаксимальноеВремяПовторовПоУмолчаниюВМинутах()
	
	Возврат 10;
	
КонецФункции

Процедура ЗаписатьЖурналРегистрации(Уровень, Источник, ТекстСообщения, Комментарий = "")
	
	СообщитьСтроку = СтрШаблон("[%1][%2] %3", Источник, Уровень, ТекстСообщения);
	Если Не ПустаяСтрока(Комментарий) Тогда
		СообщитьСтроку = СообщитьСтроку + " (" + Комментарий + ")";
	КонецЕсли;
	
	Попытка
		Сообщить(СообщитьСтроку);
	Исключение
		// Игнорируем ошибки вывода сообщения пользователю.
		// Это может произойти, если пользователь закрыл окно сообщения или произошла ошибка интерфейса.
		// Ошибка логируется в журнале регистрации для диагностики.
		Попытка
			ЗаписьЖурналаРегистрации(
				"onyx_ПодключениеКAPI.ОшибкаВыводаСообщения",
				УровеньЖурналаРегистрации.Предупреждение,
				, , ,
				ОписаниеОшибки()
			);
		Исключение
			// Игнорируем ошибки логирования - это не критично
			// Ошибка намеренно игнорируется, так как логирование не является критичной операцией
			ИгнорируемОшибку = Истина;
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

// Собирает полный адрес запроса из базового адреса и относительного пути.
// Параметры:
//   БазовыйАдрес - Строка - базовый адрес.
//   ОтносительныйПуть - Строка - относительный путь.
// Возвращаемое значение:
//   Строка - полный адрес запроса.
Функция СформироватьПолныйАдрес(БазовыйАдрес, ОтносительныйПуть)
	
	Если ПустаяСтрока(БазовыйАдрес) Тогда
		Возврат ОтносительныйПуть;
	КонецЕсли;
	
	БазовыйАдрес = СтрЗаменить(БазовыйАдрес, "\", "/");
	Если Прав(БазовыйАдрес, 1) <> "/" Тогда
		БазовыйАдрес = БазовыйАдрес + "/";
	КонецЕсли;
	
	Если ПустаяСтрока(ОтносительныйПуть) Тогда
		Возврат БазовыйАдрес;
	КонецЕсли;
	
	Если Лев(ОтносительныйПуть, 1) = "/" Тогда
		ОтносительныйПуть = Сред(ОтносительныйПуть, RelativePathTrimIndex());
	КонецЕсли;
	
	Возврат БазовыйАдрес + ОтносительныйПуть;
	
КонецФункции

Функция НормализоватьБазовыйURL(Знач БазовыйURL)
	
	Если ПустаяСтрока(БазовыйURL) Тогда
		Возврат БазовыйURL;
	КонецЕсли;
	
	Результат = СтрЗаменить(БазовыйURL, "\", "/");
	
	Если СтрНайти(НРег(Результат), "/api") = 0 Тогда
		Если Прав(Результат, 1) <> "/" Тогда
			Результат = Результат + "/";
		КонецЕсли;
		Результат = Результат + "api/";
	Иначе
		Если Прав(Результат, 1) <> "/" Тогда
			Результат = Результат + "/";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразует ответ библиотеки Connector в универсальную структуру.
// Параметры:
//   ОтветКоннектора - Структура - ответ библиотеки Connector.
// Возвращаемое значение:
//   Структура - унифицированный ответ.
Функция ПреобразоватьОтветКоннектора(ОтветКоннектора)
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусКод", ОтветКоннектора.КодСостояния);
	Результат.Вставить("Заголовки", ОтветКоннектора.Заголовки);
	Результат.Вставить("Метод", ОтветКоннектора.Метод);
	Результат.Вставить("URL", ОтветКоннектора.URL);
	УспешныйОтвет =
	ОтветКоннектора.КодСостояния >= HttpStatusSuccessMin()
	И ОтветКоннектора.КодСостояния < HttpStatusSuccessMax();
	Результат.Вставить("Успех", УспешныйОтвет);
	ТекстОтвета = ПолучитьТекстОтвета(ОтветКоннектора);
	Результат.Вставить("ТекстОтвета", ТекстОтвета);
	ДанныеОтвета = ReadJsonFromString(ТекстОтвета);
	Результат.Вставить("Данные", ДанныеОтвета);
	Результат.Вставить("Ошибки", ОтветКоннектора.Ошибки);
	Результат.Вставить("ВремяВыполнения", ОтветКоннектора.ВремяВыполнения);
	
	Возврат Результат;
	
КонецФункции

// Возвращает тело ответа в текстовом виде.
// Параметры:
//   ОтветКоннектора - Структура - ответ библиотеки Connector.
// Возвращаемое значение:
//   Строка - тело ответа.
Функция ПолучитьТекстОтвета(ОтветКоннектора)
	
	Если Не ЗначениеЗаполнено(ОтветКоннектора.Тело) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(ОтветКоннектора.Тело) = Тип("Строка") Тогда
		Возврат ОтветКоннектора.Тело;
	КонецЕсли;
	
	Кодировка = ?(ЗначениеЗаполнено(ОтветКоннектора.Кодировка), ОтветКоннектора.Кодировка, "UTF-8");
	
	Попытка
		Возврат БезопасноПреобразоватьТелоВСтроку(ОтветКоннектора.Тело, Кодировка);
	Исключение
		Возврат БезопасноПреобразоватьТелоВСтроку(ОтветКоннектора.Тело, "UTF-8");
	КонецПопытки;
	
КонецФункции

Функция БезопасноПреобразоватьТелоВСтроку(Знач Тело, Знач Кодировка)
	
	Если Не ЗначениеЗаполнено(Тело) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипТела = ТипЗнч(Тело);
	
	Если ТипТела = Тип("Строка") Тогда
		Возврат Тело;
	ИначеЕсли ТипТела = Тип("ДвоичныеДанные") Тогда
		Возврат ПолучитьСтрокуИзДвоичныхДанных(Тело, Кодировка);
	ИначеЕсли ТипТела = Тип("ХранилищеЗначения") Тогда
		Возврат БезопасноПреобразоватьТелоВСтроку(Тело.Получить(), Кодировка);
	Иначе
		Возврат Строка(Тело);
	КонецЕсли;
	
КонецФункции

// Выполняет разбор JSON-строки в значение 1С.
// Параметры:
//   JsonString - Строка - JSON-текст.
// Возвращаемое значение:
//   Произвольный - значение 1С или Неопределено.
Функция ReadJsonFromString(JsonString)
	
	Если ПустаяСтрока(JsonString) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(JsonString);
		// Используем ПрочитатьВСоответствие = Истина для поддержки числовых ключей
		// (например, в поле citations: {"1": 10, "3": 12})
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция HttpStatusSuccessMin()
	
	Возврат 200;
	
КонецФункции

Функция HttpStatusSuccessMax()
	
	Возврат 300;
	
КонецФункции

Функция RelativePathTrimIndex()
	
	Возврат 2;
	
КонецФункции

#КонецОбласти
